In [6]:
import pandas as pd
import sqlite3
import matplotlib.pyplot as plt
%matplotlib inline

In [13]:
def run_query(q):
    with sqlite3.connect('chinook.db') as conn:
        return pd.read_sql(q,conn)

In [14]:
def run_command(c):
    with sqlite3.connect ('chinook.db') as conn:
        conn.isolation_level = None
        conn.execute(c)

In [15]:
def show_tables():
    q = 'SELECT name, type FROM sqlite_master\
         WHERE type IN ("table","view");'
    return run_query(q)

In [16]:
show_tables()

              name   type
0            album  table
1           artist  table
2         customer  table
3         employee  table
4            genre  table
5          invoice  table
6     invoice_line  table
7       media_type  table
8         playlist  table
9   playlist_track  table
10           track  table

In [24]:
q = "WITH\
    intr as (SELECT inv.billing_country ct, genre_id genre FROM track t \
             INNER JOIN invoice_line il ON il.track_id=t.track_id\
             INNER JOIN invoice inv ON inv.invoice_id=il.invoice_id)\
    SELECT intr.ct country, count(*) sales FROM intr\
    INNER JOIN genre g ON g.genre_id=intr.genre\
    GROUP BY country;"
genre_sales_usa = run_query(q)

In [25]:

genre_sales_usa.hist(ax=ax)

           country  sales
0        Argentina     40
1        Australia     82
2          Austria     70
3          Belgium     61
4           Brazil    432
5           Canada    541
6            Chile     98
7   Czech Republic    276
8          Denmark     38
9          Finland     80
10          France    393
11         Germany    338
12         Hungary     79
13           India    185
14         Ireland    116
15           Italy     51
16     Netherlands     66
17          Norway     73
18          Poland     77
19        Portugal    187
20           Spain     99
21          Sweden     76
22             USA   1051
23  United Kingdom    248